[
  {"id":1,"title":"Greet with kindness","text":"Say a warm 'Good morning' to the watchman or helper you meet today. A small greeting brightens someone's day.","deeds":["Greet one person with a smile and kind words"]},
  {"id":2,"title":"Call home","text":"Call a parent or elder and tell them you love them. It takes 30 seconds but means the world.","deeds":["Call and say 'I love you' or ask how they are"]},
  {"id":3,"title":"Share a compliment","text":"Give a genuine compliment — to a peer, a colleague or a stranger. It lifts morale.","deeds":["Give a sincere compliment to one person"]},
  {"id":4,"title":"Help a hand","text":"Offer to help carry a small burden — a bag or door. Small help shows big respect.","deeds":["Help someone carry or hold something briefly"]},
  {"id":5,"title":"Thankful note","text":"Send one short 'thank you' message to someone who helped you recently.","deeds":["Send a short thank-you message to one person"]},
  {"id":6,"title":"Listen with intent","text":"Listen fully to someone today without interrupting — let them be heard.","deeds":["Have one mindful conversation and listen fully"]},
  {"id":7,"title":"Pick up a piece of trash","text":"If you see trash on the street, pick it up. Small care for surroundings matters.","deeds":["Pick up one piece of litter and dispose properly"]},
  {"id":8,"title":"Smile first","text":"Smiling is contagious. Smile at three people today.","deeds":["Smile genuinely at three different people"]},
  {"id":9,"title":"Encourage someone","text":"Send an encouraging message to someone who might need it.","deeds":["Send one encouraging note to a friend or colleague"]},
  {"id":10,"title":"Share your time","text":"Offer 10 minutes of your time to help someone learn or solve something.","deeds":["Spend 10 minutes helping someone without expecting anything"]},
  {"id":11,"title":"Compliment a stranger","text":"Notice something good in someone (their effort, outfit, work) and tell them.","deeds":["Give a short compliment to a stranger or acquaintance"]},
  {"id":12,"title":"Be punctual","text":"Arrive on time for one commitment today. Respect for others' time is kindness.","deeds":["Be on time for one meeting or appointment"]},
  {"id":13,"title":"Forgive a small fault","text":"Let go of a small irritation. Forgiveness clears your heart.","deeds":["Let go of one small irritation without mentioning it"]},
  {"id":14,"title":"Share a resource","text":"Share an article, tool, or tip that can help someone.","deeds":["Share one useful resource with someone who can benefit"]},
  {"id":15,"title":"Pay a compliment to service staff","text":"Thank a delivery person, waiter, or helper genuinely.","deeds":["Thank one service person for their help"]},
  {"id":16,"title":"Send gratitude","text":"Write one line of gratitude to yourself for something you've done this week.","deeds":["Write one sentence of gratitude to yourself"]},
  {"id":17,"title":"Donate a small item","text":"Give an item you no longer need (clothes, book) to someone who can use it.","deeds":["Donate one small, usable item"]},
  {"id":18,"title":"Offer reassurance","text":"Ease someone's worry with a short positive word — 'It will be okay'.","deeds":["Offer a reassuring word to one worried person"]},
  {"id":19,"title":"Respect nature","text":"Water a plant or sweep a small area outside your home.","deeds":["Tend to one plant or clean a small patch outdoors"]},
  {"id":20,"title":"Share a smile online","text":"Post a kind message or a helpful tip in a group that you are part of.","deeds":["Post one positive or helpful message in an online group"]},
  {"id":21,"title":"Be patient in traffic","text":"If stuck in a queue, allow space and be calm — patience helps everyone.","deeds":["Practice calm patience in traffic or a queue"]},
  {"id":22,"title":"Offer a seat","text":"Give up your seat to someone who needs it more on public transport.","deeds":["Offer your seat to someone in need"]},
  {"id":23,"title":"Teach a quick skill","text":"Share a 2-minute tip or trick that could help a friend in their work.","deeds":["Teach someone one quick useful tip"]},
  {"id":24,"title":"Pay attention","text":"When someone speaks, put your phone away and give your full attention.","deeds":["Listen to one person without using your phone"]},
  {"id":25,"title":"Apologize if needed","text":"If you hurt someone recently, say sorry. Small apologies heal big things.","deeds":["Apologize sincerely to someone you upset"]},
  {"id":26,"title":"Be honest kindly","text":"Give honest feedback that is gentle and helpful.","deeds":["Share one honest-but-kind piece of feedback"]},
  {"id":27,"title":"Share a meal","text":"Invite someone for a cup of tea or share your snack.","deeds":["Share a small meal or snack with someone"]},
  {"id":28,"title":"Encourage a young one","text":"Tell a child or junior that they did well today.","deeds":["Give positive feedback to a child or junior"]},
  {"id":29,"title":"Help plan","text":"Help someone plan one next small step for their task.","deeds":["Help someone make one small plan for a task"]},
  {"id":30,"title":"Be generous with praise","text":"Praise effort more than result — it builds confidence.","deeds":["Praise someone's effort sincerely"]}
]
